Emacs.org
#+TITLE: Emacs Configuration
#+PROPERTY: header-args:emacs-lisp :tangle ./.emacs.d/init.el

This is an ongoing evolution of my original Emacs configuration files, inspired by a bunch of resources I've found online.

* Table of Contents
:PROPERTIES:
:TOC:      this
:END:
-  [[#startup-performance][Startup Performance]]
-  [[#system-settings][System Settings]]
-  [[#keep-emacsd-clean][Keep .emacs.d Clean]]
-  [[#package-management][Package Management]]
-  [[#update-load-path][Update Load Path]]
-  [[#helper-functions][Helper Functions]]
  -  [[#platform-helpers][Platform Helpers]]
-  [[#server-mode][Server Mode]]
-  [[#desktop-environment][Desktop Environment]]
-  [[#keyboard-bindings][Keyboard Bindings]]
  -  [[#esc-cancels-all][ESC Cancels All]]
  -  [[#lets-be-evil][Let's Be Evil]]
  -  [[#keybinding-panel-which-key][Keybinding Panel (which-key)]]
  -  [[#simplify-leader-bindings-generalel][Simplify Leader Bindings (general.el)]]
  -  [[#enable-keychord-bind-with-use-package][Enable keychord bind with use-package]]
-  [[#general-configuration][General Configuration]]
  -  [[#user-interface][User Interface]]
  -  [[#theme][Theme]]
  -  [[#font][Font]]
    -  [[#set-the-font][Set the font]]
    -  [[#enable-proper-unicode-glyph-support][Enable proper Unicode glyph support]]
    -  [[#emojis-in-buffers][Emojis in buffers]]
  -  [[#mode-line][Mode Line]]
    -  [[#basic-customization][Basic Customization]]
    -  [[#enable-mode-diminishing][Enable Mode Diminishing]]
    -  [[#smart-mode-line][Smart Mode Line]]
    -  [[#doom-modeline][Doom Modeline]]
  -  [[#notifications][Notifications]]
  -  [[#auto-saving-changed-files][Auto-Saving Changed Files]]
  -  [[#auto-reverting-changed-files][Auto-Reverting Changed Files]]
  -  [[#ui-toggles][UI Toggles]]
  -  [[#highlight-matching-braces][Highlight Matching Braces]]
  -  [[#displaying-world-time][Displaying World Time]]
  -  [[#pinentry][Pinentry]]
  -  [[#tramp][TRAMP]]
-  [[#editing-configuration][Editing Configuration]]
  -  [[#tab-widths][Tab Widths]]
  -  [[#use-spaces-instead-of-tabs-for-indentation][Use spaces instead of tabs for indentation]]
  -  [[#commenting-lines][Commenting Lines]]
  -  [[#automatically-clean-whitespace][Automatically clean whitespace]]
  -  [[#use-parinfer-for-lispy-languages][Use Parinfer for Lispy languages]]
-  [[#configuration-files][Configuration Files]]
  -  [[#helpers][Helpers]]
  -  [[#bindings][Bindings]]
-  [[#stateful-keymaps-with-hydra][Stateful Keymaps with Hydra]]
-  [[#better-completions-with-ivy][Better Completions with Ivy]]
-  [[#jumping-with-avy][Jumping with Avy]]
-  [[#buffer-management][Buffer Management]]
  -  [[#bindings][Bindings]]
-  [[#window-management][Window Management]]
  -  [[#frame-scaling--zooming][Frame Scaling / Zooming]]
  -  [[#window-selection-with-ace-window][Window Selection with ace-window]]
  -  [[#window-history-with-winner-mode][Window History with winner-mode]]
  -  [[#set-margins-for-modes][Set Margins for Modes]]
-  [[#expand-region][Expand Region]]
-  [[#credential-management][Credential Management]]
-  [[#file-browsing][File Browsing]]
  -  [[#dired][Dired]]
  -  [[#opening-files-externally][Opening Files Externally]]
-  [[#org-mode][Org Mode]]
  -  [[#org-configuration][Org Configuration]]
  -  [[#weekly-planning][Weekly Planning]]
  -  [[#automatically-tangle-on-save][Automatically "Tangle" on Save]]
  -  [[#fonts-and-bullets][Fonts and Bullets]]
  -  [[#org-file-paths][Org File Paths]]
  -  [[#agenda][Agenda]]
  -  [[#tags][Tags]]
  -  [[#tasks][Tasks]]
  -  [[#journal][Journal]]
  -  [[#capture-templates][Capture Templates]]
  -  [[#block-templates][Block Templates]]
  -  [[#pomodoro][Pomodoro]]
  -  [[#protocol][Protocol]]
  -  [[#searching][Searching]]
  -  [[#bindings][Bindings]]
  -  [[#end-use-package-org-mode][End use-package org-mode]]
  -  [[#update-table-of-contents-on-save][Update Table of Contents on Save]]
  -  [[#calendar-sync][Calendar Sync]]
  -  [[#reminders][Reminders]]
  -  [[#presentations][Presentations]]
  -  [[#addons-to-try][Addons to Try]]
-  [[#development][Development]]
  -  [[#git][Git]]
    -  [[#magit][Magit]]
    -  [[#forge][Forge]]
    -  [[#magit-todos][magit-todos]]
    -  [[#git-link][git-link]]
    -  [[#git-gutter][Git Gutter]]
  -  [[#projectile][Projectile]]
    -  [[#initial-setup][Initial Setup]]
    -  [[#project-configurations][Project Configurations]]
  -  [[#languages][Languages]]
    -  [[#language-server-support][Language Server Support]]
    -  [[#debug-adapter-support][Debug Adapter Support]]
    -  [[#clojure][Clojure]]
    -  [[#common-lisp][Common Lisp]]
    -  [[#scheme][Scheme]]
    -  [[#typescript-and-javascript][TypeScript and JavaScript]]
    -  [[#rust][Rust]]
    -  [[#ocaml][OCaml]]
    -  [[#f][F#]]
    -  [[#emacs-lisp][Emacs Lisp]]
    -  [[#scheme][Scheme]]
    -  [[#markdown][Markdown]]
    -  [[#html][HTML]]
    -  [[#yaml][YAML]]
  -  [[#productivity][Productivity]]
    -  [[#syntax-checking-with-flycheck][Syntax checking with Flycheck]]
    -  [[#snippets][Snippets]]
    -  [[#smart-parens][Smart Parens]]
    -  [[#rainbow-delimiters][Rainbow Delimiters]]
    -  [[#rainbow-mode][Rainbow Mode]]
  -  [[#tools][Tools]]
    -  [[#debbugs-mainly-for-guix][Debbugs (mainly for Guix)]]
  -  [[#reference][Reference]]
    -  [[#http][HTTP]]
-  [[#writing][Writing]]
  -  [[#darkroom-for-distraction-free-writing][Darkroom for distraction-free writing]]
-  [[#applications][Applications]]
  -  [[#binding-prefix][Binding Prefix]]
  -  [[#mail][Mail]]
    -  [[#mu4e][mu4e]]
  -  [[#calendar][Calendar]]
  -  [[#finance][Finance]]
  -  [[#eshell][eshell]]
    -  [[#configuration][Configuration]]
    -  [[#shell-commands][Shell Commands]]
    -  [[#visual-commands][Visual Commands]]
    -  [[#better-colors][Better Colors]]
    -  [[#fish-completion][Fish Completion]]
    -  [[#history-autocompletion][History Autocompletion]]
  -  [[#vterm][vterm]]
  -  [[#multi-term][multi-term]]
  -  [[#ediff][ediff]]
  -  [[#chat][Chat]]
    -  [[#tracking][Tracking]]
    -  [[#telegram][Telegram]]
    -  [[#erc][ERC]]
      -  [[#configuration][Configuration]]
      -  [[#bindings][Bindings]]
      -  [[#reference][Reference]]
  -  [[#mastodon][Mastodon]]
  -  [[#rss-with-elfeed][RSS with Elfeed]]
  -  [[#media][Media]]
    -  [[#emms][EMMS]]
-  [[#system-utilities][System Utilities]]
  -  [[#guix][Guix]]
  -  [[#daemons][Daemons]]
  -  [[#pulseaudio][PulseAudio]]
  -  [[#bluetooth][Bluetooth]]
  -  [[#proced][Proced]]
  -  [[#docker][Docker]]
-  [[#runtime-performance][Runtime Performance]]
-  [[#emacs-profile][Emacs Profile]]
-  [[#inspiration][Inspiration]]

* Startup Performance

Make startup faster by reducing the frequency of garbage collection and then use a hook to measure Emacs startup time.

#+begin_src emacs-lisp

;; The default is 800 kilobytes.  Measured in bytes.
(setq gc-cons-threshold (* 50 1000 1000))

;; Profile emacs startup
(add-hook 'emacs-startup-hook
          (lambda ()
            (message "*** Emacs loaded in %s with %d garbage collections."
                     (format "%.2f seconds"
                             (float-time
                              (time-subtract after-init-time before-init-time)))
                     gcs-done)))

#+end_src

* System Settings

Some parts of the configuration require knowledge of whether Emacs is running on a Guix system or in Termux on Android.  Also load system-specific settings from =per-system-settings.el=.

#+begin_src emacs-lisp

(load-file "~/.emacs.d/per-system-settings.el")

(require 'subr-x)
(setq dw/is-termux
      (string-suffix-p "Android" (string-trim (shell-command-to-string "uname -a"))))

;; TODO: Need a more accurate check for this!
(setq dw/is-guix-system (eq window-system 'x))

#+end_src

* Keep .emacs.d Clean

I don't want a bunch of transient files showing up as untracked in the Git repo so I move them all to another location.

#+begin_src emacs-lisp

;; Keep transient cruft out of ~/.emacs.d/
(setq user-emacs-directory "~/.cache/emacs/"
      backup-directory-alist `(("." . ,(expand-file-name "backups" user-emacs-directory)))
      url-history-file (expand-file-name "url/history" user-emacs-directory)
      auto-save-list-file-prefix (expand-file-name "auto-save-list/.saves-" user-emacs-directory)
      projectile-known-projects-file (expand-file-name "projectile-bookmarks.eld" user-emacs-directory))

;; Keep customization settings in a temporary file (thanks Ambrevar!)
(setq custom-file
      (if (boundp 'server-socket-dir)
          (expand-file-name "custom.el" server-socket-dir)
        (expand-file-name (format "emacs-custom-%s.el" (user-uid)) temporary-file-directory)))
(load custom-file t)

#+end_src

* Package Management

Set up ELPA, MELPA, and Org package repositories and load =use-package= to manage package configuration.

#+begin_src emacs-lisp

;; Initialize package sources
(require 'package)

(setq package-archives '(("melpa" . "https://melpa.org/packages/")
                         ("melpa-stable" . "https://stable.melpa.org/packages/")
                         ("org" . "https://orgmode.org/elpa/")
                         ("elpa" . "https://elpa.gnu.org/packages/")))

;; Fix an issue accessing the ELPA archive in Termux
(when dw/is-termux
  (setq gnutls-algorithm-priority "NORMAL:-VERS-TLS1.3"))

(package-initialize)
;; (unless package-archive-contents
;;   (package-refresh-contents))

;; Initialize use-package on non-Linux platforms
(unless (or (package-installed-p 'use-package)
            dw/is-guix-system)
   (package-install 'use-package))
(require 'use-package)

;; Uncomment this to get a reading on packages that get loaded at startup
;;(setq use-package-verbose t)

;; On non-Guix systems, "ensure" packages by default
(setq use-package-always-ensure (not dw/is-guix-system))

#+end_src

*Guix Packages*

#+begin_src scheme :noweb-ref packages :noweb-sep ""

"emacs-use-package"

#+end_src

* Update Load Path

I've got a folder of custom elisp files which must be added to the load path.

#+begin_src emacs-lisp

;; Add my elisp path to load-path
(push "~/.emacs.d/elisp" load-path)

#+end_src

* Helper Functions

** Platform Helpers

Here are a couple helpful functions for doing things based on what platform
Emacs is running on.  I wrote =on-platform-do= as a way to learn Emacs macros, but
there's probably a more appropriate way to do this built in to Emacs.

#+begin_src emacs-lisp

  ;; Helper function for changing OS platform keywords to system-type strings
  (defun platform-keyword-to-string (platform-keyword)
    (cond
     ((eq platform-keyword 'windows) "windows-nt")
     ((eq platform-keyword 'cygwin) "cygwin")
     ((eq platform-keyword 'osx) "darwin")
     ((eq platform-keyword 'linux) "gnu/linux")))

  ;; Define a macro that runs an elisp expression only on a particular platform
  (defmacro on-platform-do (&rest platform-expressions)
    `(cond
      ,@(mapcar
         (lambda (platform-expr)
       (let ((keyword (nth 0 platform-expr))
             (expr (nth 1 platform-expr)))
         `(,(if (listp keyword)
           `(or
             ,@(mapcar
                (lambda (kw) `(string-equal system-type ,(platform-keyword-to-string kw)))
                keyword))
            `(string-equal system-type ,(platform-keyword-to-string keyword)))
            ,expr)))
         platform-expressions)))

#+end_src

* Server Mode

Start the Emacs server from this instance so that all =emacsclient= calls are
routed here.

#+begin_src emacs-lisp

(server-start)

#+end_src

* Desktop Environment

Load up the desktop environment if on a machine that supports it and the =--use-exwm= argument was passed to Emacs on startup.  Desktop environment and window management code can be found in Desktop.org.

#+begin_src emacs-lisp

(setq dw/exwm-enabled (and (not dw/is-termux)
                           (eq window-system 'x)
                           (seq-contains command-line-args "--use-exwm")))

(when dw/exwm-enabled
  (load-file "~/.dotfiles/.emacs.d/exwm.el"))

#+end_src

*Guix Packages*

Despite the code being in Desktop.org, include the emacs packages for the desktop environment in this file so that they can be included in the Emacs profile.

#+begin_src scheme :noweb-ref packages :noweb-sep ""

"emacs-exwm"
"emacs-desktop-environment"

#+end_src

