.emacs.d/init.el

(use-package org-bullets
  :if (not dw/is-termux)
  :after org
  :hook (org-mode . org-bullets-mode)
  :custom
  (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))

;; Replace list hyphen with dot
(font-lock-add-keywords 'org-mode
                        '(("^ *\\([-]\\) "
                          (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

(dolist (face '((org-level-1 . 1.4)
                (org-level-2 . 1.3)
                (org-level-3 . 1.2)
                (org-level-4 . 1.15)
                (org-level-5 . 1.1)
                (org-level-6 . 1.1)
                (org-level-7 . 1.1)
                (org-level-8 . 1.1)))
    (set-face-attribute (car face) nil :font "Cantarell" :weight 'regular :height (cdr face)))

;; Make sure org-indent face is available
(require 'org-indent)

;; Ensure that anything that should be fixed-pitch in Org files appears that way
(set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
(set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
(set-face-attribute 'org-indent nil :inherit '(org-hide fixed-pitch))
(set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
(set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
(set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
(set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)

;; TODO: Others to consider
;; '(org-document-info-keyword ((t (:inherit (shadow fixed-pitch)))))
;; '(org-meta-line ((t (:inherit (font-lock-comment-face fixed-pitch)))))
;; '(org-property-value ((t (:inherit fixed-pitch))) t)
;; '(org-special-keyword ((t (:inherit (font-lock-comment-face fixed-pitch)))))
;; '(org-table ((t (:inherit fixed-pitch :foreground "#83a598"))))
;; '(org-tag ((t (:inherit (shadow fixed-pitch) :weight bold :height 0.8))))
;; '(org-verbatim ((t (:inherit (shadow fixed-pitch))))))

(setq org-directory
  (if dw/is-termux
      "~/storage/shared/Notes"
      "~/Notes"))

(defun dw/org-path (path)
  (expand-file-name path org-directory))

(setq org-journal-dir (dw/org-path "Journal/"))

(defun dw/get-todays-journal-file-name ()
  "Gets the journal file name for today's date"
  (interactive)
  (let* ((journal-file-name
           (expand-file-name
             (format-time-string "%Y/%Y-%2m-%B.org")
             org-journal-dir))
         (journal-year-dir (file-name-directory journal-file-name)))
    (if (not (file-directory-p journal-year-dir))
      (make-directory journal-year-dir))
    journal-file-name))

(setq org-default-notes-file (dw/org-path "Projects.org"))

(setq org-agenda-files
  (list
    (dw/org-path "Habits.org")
    (dw/org-path "Work.org")
    (dw/org-path "AutoRest.org")
    (dw/org-path "Calendar/Personal.org")
    (dw/org-path "Calendar/Work.org")
    (dw/org-path "Projects.org")))
    ;(dw/get-todays-journal-file-name)))

(setq org-agenda-window-setup 'other-window)
(setq org-agenda-span 'day)
(setq org-stuck-projects '("+LEVEL=2/TODO" ("NEXT") nil ""))
(setq org-agenda-start-with-log-mode t)

;; Configure custom agenda views
(setq org-agenda-custom-commands
  '(("d" "Dashboard"
     ((agenda "" ((org-deadline-warning-days 7)))
      (todo "PROC" ((org-agenda-overriding-header "Process Tasks")))
      (todo "NEXT"
        ((org-agenda-overriding-header "Next Tasks")))
      (tags-todo "agenda/ACTIVE" ((org-agenda-overriding-header "Active Projects")))))
      ;; (todo "TODO"
      ;;   ((org-agenda-overriding-header "Unprocessed Inbox Tasks")
      ;;    (org-agenda-files `(,dw/org-inbox-path))
      ;;    (org-agenda-text-search-extra-files nil)))))

    ("n" "Next Tasks"
     ((todo "NEXT"
        ((org-agenda-overriding-header "Next Tasks")))))

    ("p" "Active Projects"
     ((agenda "")
      (todo "ACTIVE"
        ((org-agenda-overriding-header "Active Projects")
         (org-agenda-max-todos 5)
         (org-agenda-files org-agenda-files)))))

    ("w" "Workflow Status"
     ((todo "WAIT"
            ((org-agenda-overriding-header "Waiting on External")
             (org-agenda-files org-agenda-files)))
      (todo "REVIEW"
            ((org-agenda-overriding-header "In Review")
             (org-agenda-files org-agenda-files)))
      (todo "PLAN"
            ((org-agenda-overriding-header "In Planning")
             (org-agenda-todo-list-sublevels nil)
             (org-agenda-files org-agenda-files)))
      (todo "BACKLOG"
            ((org-agenda-overriding-header "Project Backlog")
             (org-agenda-todo-list-sublevels nil)
             (org-agenda-files org-agenda-files)))
      (todo "READY"
            ((org-agenda-overriding-header "Ready for Work")
             (org-agenda-files org-agenda-files)))
      (todo "ACTIVE"
            ((org-agenda-overriding-header "Active Projects")
             (org-agenda-files org-agenda-files)))
      (todo "COMPLETED"
            ((org-agenda-overriding-header "Completed Projects")
             (org-agenda-files org-agenda-files)))
      (todo "CANC"
            ((org-agenda-overriding-header "Cancelled Projects")
             (org-agenda-files org-agenda-files)))))

    ;; Projects on hold
    ("h" tags-todo "+LEVEL=2/+HOLD"
     ((org-agenda-overriding-header "On-hold Projects")
      (org-agenda-files org-agenda-files)))

    ;; Low-effort next actions
    ("e" tags-todo "+TODO=\"NEXT\"+Effort<15&+Effort>0"
     ((org-agenda-overriding-header "Low Effort Tasks")
      (org-agenda-max-todos 20)
      (org-agenda-files org-agenda-files)))))

;; Configure common tags
(setq org-tag-alist
  '((:startgroup)
     ; Put mutually exclusive tags here
     (:endgroup)
     ("@errand" . ?E)
     ("@home" . ?H)
     ("@work" . ?W)
     ("agenda" . ?a)
     ("planning" . ?p)
     ("publish" . ?P)
     ("batch" . ?b)
     ("note" . ?n)
     ("idea" . ?i)
     ("thinking" . ?t)
     ("recurring" . ?r)))

;; Configure task state change tag triggers
;; (setq org-todo-state-tags-triggers
;;   (quote (("CANC" ("cancelled" . t))
;;           ("WAIT" ("waiting" . t))
;;           ("HOLD" ("waiting") ("onhold" . t))
;;           (done ("waiting") ("onhold"))
;;           ("TODO" ("waiting") ("cancelled") ("onhold"))
;;           ("DONE" ("waiting") ("cancelled") ("onhold")))))

;; Configure TODO settings
(setq org-log-done 'time)
(setq org-log-into-drawer t)
(setq org-datetree-add-timestamp 'inactive)
(setq org-habit-graph-column 60)
(setq org-fontify-whole-heading-line t)
(setq org-todo-keywords
  '((sequence "TODO(t)" "NEXT(n)" "PROC" "|" "DONE(d!)")
    (sequence "BACKLOG(b)" "PLAN(p)" "READY(r)" "ACTIVE(a)" "REVIEW(v)" "WAIT(w@/!)" "HOLD(h)" "|" "COMPLETED(c)" "CANC(k@)")
    (sequence "GOAL(g)" "|" "ACHIEVED(v)" "MAINTAIN(m)")))

(use-package org-journal
  :defer t
  :ensure t  ;; Not in Guix yet
  :custom
  (org-journal-file-type 'daily)
  (org-journal-date-format "%B %d, %Y - %A")
  (org-journal-dir "~/Notes/Journal/")
  (org-journal-time-format "%-l:%M %p - ")
  (org-journal-file-format "%Y-%m-%d.org")
  (org-journal-enable-agenda-integration t))
